export const changeLog = {
  '2024-12-25': '巨大更新：基于GPT-4o-mini的微调模型，专业针对MC进行翻译！',
  '2024-12-23':
    '是万万没想到会被盗刷的情况。所以加了速率限制，10秒内最多三次，上传的json也有了一点限制，大型mod你得拆开，一个json最多1000个键值对，api key那头我也限制住了，保护信用卡',
  '2024-12-22': '完全i18n，切换到官方gpt-4o-mini，不再使用第三方api',
  '2024-12-21': '添加双向翻译，i18n进度推进。',
  '2024-12-20': `完善后端，优化模型输出，确保输出非json格式，防止破坏语言文件。
增加i18n，接入openai官方渠道gpt-4o-mini`,
  '2024-12-18': '完善DNT相关',
  '2024-12-16': '优化js大小，收集数据进行统计',
  '2024-12-15': `进一步完善后端提示词，更换gpt-4o-mini到更可靠的渠道，
进一步优化前端js文件`,
}
